// 200 成功
// 1000 用户名不能为空
// 302 账号已注册
// 303 账号或密码错误
// 304 邮箱格式错误
// 305 验证码发送失败
// 5000 服务器异常

exports.state={
    1000:{
        code:1000,
        msg:"用户名不能为空"
    },
    1001:{
        code:1001,
        msg:"账号不能为空"
    },
    1002:{
        code:1002,
        msg:"token过期",
    },
    1003:{
        code:1003,
        msg:"token不存在",
    },
    2000:{
        code:2000,
        msg:"手机号格式错误"
    },
    2001:{
        code:2001,
        msg:"密码格式错误"
    },
    2002:{
        code:2002,
        msg:"邮箱格式错误"
    },
    2003:{
        code:2003,
        msg:"验证码格式错误"
    },
    2004:{
        code:2004,
        msg:"验证码错误"
    },
    2005:{
        code:2005,
        msg:"该邮箱未获取验证码"
    },
    2006:{
        code:2006,
        msg:"账号格式错误"
    },
    2007:{
        code:2007,
        msg:"账号或者密码错误"
    },
    3000:{
        code:3000,
        msg:"用户名已存在"
    },
    3001:{
        code:3001,
        msg:"手机号已经存在"
    },
    3002:{
        code:3002,
        msg:"邮箱已经存在"
    },
    3003:{
        code:3003,
        msg:"验证码过期重新获取"
    },
    4000:{
        code:4000,
        msg:"验证码发送失败，请重新获取"
    },
    5000:{
        code:5000,
        msg:"服务器异常"
    },
}